
{"name":"@shawnsandy/ideas","version":"0.1.19","description":"Eleventy toolkit","homepage":"https://github.com/shawn-sandy/idea#readme","author":"shawnsandy","authorEmail":"shawnsandy04@gmail.com","license":"MIT","readme":"# IDEA Core\r\n\r\n# A simple way to visualize IDEA's\r\n\r\n_Idea is currently in early production beta, feel free to open an issues for features, bugs suggestions etc._\r\n\r\n**IDEA(beta) is a simple and easy to use HTML, CSS and JAVASCRIPT toolkit (framework if you prefer) for building and managing your teams design systems. allowing you to turn your ideas and vision into products.**\r\n\r\n> A design system is an agreed upon set of principles and a living suite of modular, resuable parts. This includes standards around style, color, language and behavior. The system allows us to work smarter and innovate on products faster, while providing a more predictable user experience.\r\n\r\n> [Amélie Lamont @amelielamont](https://twitter.com/amelielamont/status/1072917354819059713)\r\n\r\n### Core\r\n\r\nCore is the engine of Idea, a collection Eleventy packages and tools behind the system.\r\n\r\n---\r\n\r\n## Features\r\n\r\n- Atomic driven component system / structure\r\n- Eleventy powered static site generator\r\n- Markdown / HTML driven content and components\r\n- Vue.js integration\r\n- Javascript based template **[Nunjucks](https://mozilla.github.io/nunjucks/)**, Handlebars, Mustache...\r\n- Modular\r\n- Webpack / Gulp\r\n- Customizable\r\n\r\n### Install\r\n\r\n```\r\nnpm i @shawnsandy/ideas\r\n```\r\n\r\n### Usage\r\n\r\n**Add to eleventy** Add the following to your config file `eleventy.js` inside the `modules.exports` function.\r\n\r\n```\r\n   eleventyConfig.addPlugin(require('@shawnsandy/ideas'))\r\n```\r\n\r\n[Eleventy Shortcodes](./ELEVENTY.md)\r\n\r\n### TODOS\r\n\r\n- Complete the docs\r\n- Add examples\r\n\r\n## Licence (MIT)\r\n\r\nThe MIT License (MIT)\r\n\r\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\r\n\r\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\r\n\r\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\r\n\r\n## Contribute\r\n\r\n## Enjoy\r\n\r\n**Wakanda Forever :)**\r\n","keywords":["design","system","eleventy","style-guide"]}
